# <u>Student Performance Analysis</u>

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
file_path = "E:/Jupyter/Masai BA/PROJECT_2/DATA/StudentsPerformance.csv"
df = pd.read_csv(file_path)
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [6]:
#create the 'student_id' column starting from 1
df.insert(0, 'student_id', range(1, len(df) + 1))

In [7]:
df.columns = [col.strip().lower().replace(" ", "_") for col in df.columns]
print("Dataset Info:")
df.info()

Dataset Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   student_id                   1000 non-null   int64
 1   gender                       1000 non-null   object
 2   race/ethnicity               1000 non-null   object
 3   parental_level_of_education  1000 non-null   object
 4   lunch                        1000 non-null   object
 5   test_preparation_course      1000 non-null   object
 6   math_score                   1000 non-null   int64
 7   reading_score                1000 non-null   int64
 8   writing_score                1000 non-null   int64
dtypes: int64(4), object(5)
memory usage: 70.4+ KB

In [8]:
#check missing values
print("No. of missing values:")
df.isnull().sum()

No. of missing values:

student_id                     0
gender                         0
race/ethnicity                 0
parental_level_of_education    0
lunch                          0
test_preparation_course        0
math_score                     0
reading_score                  0
writing_score                  0
dtype: int64

In [9]:
#check duplicate values
print("No. of duplicate values:")
df[df.duplicated()].sum()

No. of duplicate values:

student_id                     0
gender                         0
race/ethnicity                 0
parental_level_of_education    0
lunch                          0
test_preparation_course        0
math_score                     0
reading_score                  0
writing_score                  0
dtype: object

In [10]:
#check blank values
print("No. of blank values:")
(df == ' ').sum()

No. of blank values:

student_id                     0
gender                         0
race/ethnicity                 0
parental_level_of_education    0
lunch                          0
test_preparation_course        0
math_score                     0
reading_score                  0
writing_score                  0
dtype: int64

In [11]:
print("Summary Statistics:")
df.describe()

Summary Statistics:

        student_id  math_score  reading_score  writing_score
count  1000.000000  1000.00000    1000.000000    1000.000000
mean    500.500000    66.08900      69.169000      68.054000
std     288.819436    15.16308      14.600192      15.195657
min       1.000000     0.00000      17.000000      10.000000
25%     250.750000    57.00000      59.000000      57.750000
50%     500.500000    66.00000      70.000000      69.000000
75%     750.250000    77.00000      79.000000      79.000000
max    1000.000000   100.00000     100.000000     100.000000

In [12]:
#total number of student
print(f"Total Students: {df.shape[0]}")

Total Students: 1000

In [13]:
df.head()

,student_id,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,1,female,group B,bachelor's degree,standard,none,72,72,74
1,2,female,group C,some college,standard,completed,69,90,88
2,3,female,group B,master's degree,standard,none,90,95,93
3,4,male,group A,associate's degree,free/reduced,none,47,57,44
4,5,male,group C,some college,standard,none,76,78,75

In [14]:
# Calculate total score
df["total_score"] = df["math_score"] + df["reading_score"] + df["writing_score"]

In [15]:
max_possible_score = 300  # 100 for math + 100 for reading + 100 for writing
# Calculate the percentage
df["percentage"] = round((df["total_score"] / max_possible_score) * 100, 2)

In [16]:
df.head()

,student_id,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,total_score,percentage
0,1,female,group B,bachelor's degree,standard,none,72,72,74,218,72.67
1,2,female,group C,some college,standard,completed,69,90,88,247,82.33
2,3,female,group B,master's degree,standard,none,90,95,93,278,92.67
3,4,male,group A,associate's degree,free/reduced,none,47,57,44,148,49.33
4,5,male,group C,some college,standard,none,76,78,75,229,76.33

In [17]:
df.to_csv('StudentsPerformance_processed.csv', index=False)
print("Cleaned DataFrame successfully saved to StudentsPerformance_cleaned.csv")

Cleaned DataFrame successfully saved to StudentsPerformance_cleaned.csv

In [18]:
print("Summary Statistics:")
df.describe()

Summary Statistics:

,student_id,math_score,reading_score,writing_score,total_score,percentage
count,1000.000000,1000.00000,1000.000000,1000.000000,1000.000000,1000.000000
mean,500.500000,66.08900,69.169000,68.054000,203.312000,67.770580
std,288.819436,15.16308,14.600192,15.195657,42.771978,14.257311
min,1.000000,0.00000,17.000000,10.000000,27.000000,9.000000
25%,250.750000,57.00000,59.000000,57.750000,175.000000,58.330000
50%,500.500000,66.00000,70.000000,69.000000,205.000000,68.330000
75%,750.250000,77.00000,79.000000,79.000000,233.000000,77.670000
max,1000.000000,100.00000,100.000000,100.000000,300.000000,100.000000